import java.io.*;
import static java.lang.Math.*;
public class z8 {
    public static String hit(double x, double y) {
        if (((x > -5) && (x < -4) && (y < x + 4) && (y > -x - 6)) ||
                ((x > -4) && (x < -3) && (y < x + 4) && (y > 2 * x + 6)) ||
                ((x > -3) && (x < -2) && (y < sqrt(4 - pow(x + 1, 2)) + 1) && (y > -2 * x - 6)) ||
                ((x > -2) && (x < -1) && (y < sqrt(4 - pow(x + 1, 2)) + 1) && (y > x)) ||
                ((x > -1) && (x < 0) && ((y < 2.0 / 3 * x + 11.0 / 3) && (y > 5.0 / 3 * x + 5.0 / 3) ||
                        (y < x + 1 && (pow(x + 1, 2) + pow(y - 1, 2) < 4))))) {
            return "Точка попала в область первой фигуры\n";
        }
        else if (((x > 0) && (x < 1) && (y < 0.5 * x - 5) && (y > 0.25 * x - 5)) ||
                ((x > 1) && (x < 2) && (y < 0.5 * x - 5) && (y > 0.25 * x - 5)) ||
                ((x > 2) && (x < 3) && ((y < -x + 1) && (Math.pow(x - 4, 2) + Math.pow(y + 1, 2) <= 4) || (y < 0.5 * x - 5) && (y > 0.25 * x - 5))) ||
                ((x > 3) && (x < 4) && ((y < x - 5) && (Math.pow(x - 4, 2) + Math.pow(y + 1, 2) <= 4) || (y < 0.5 * x - 5) && (y > 0.25 * x - 5))) ||
                ((x > 4) && (x < 5) && ((Math.pow(x - 4, 2) + Math.pow(y + 1, 2) < 4) && (y > -x + 5) || (y < 0 && y >= -2) || (y < -3 * x + 10) && (y > -x))) ||
                ((x > 5) && (x < 6) && (Math.pow(x - 4, 2) + Math.pow(y + 1, 2) < 4) && (y > -2)) ||
                ((x > 6) && (x < 7) && (y < -x + 5) && (y > -2))) {
            return "Точка попала в область второй фигуры\n";
        }
        else if (((x >= -5) && (x <= -4) && (y <= x + 4) && (y >= -x - 6)) ||
                ((x >= -4) && (x <= -3) && (y <= x + 4) && (y >= 2 * x + 6)) ||
                ((x >= -3) && (x <= -2) && (y <= Math.sqrt(4 - Math.pow(x + 1, 2)) + 1) && (y >= -2 * x - 6)) ||
                ((x >= -2) && (x <= -1) && (y <= Math.sqrt(4 - Math.pow(x + 1, 2)) + 1) && (y >= x)) ||
                ((x >= -1) && (x <= 0) && ((y <= 2.0 / 3 * x + 11.0 / 3) && (y >= 5.0 / 3 * x + 5.0 / 3) ||
                        (y <= x + 1 && (Math.pow(x + 1, 2) + Math.pow(y - 1, 2) <= 4)))) ||
                ((x >= 1) && (x <= 2) && ((y <= 2.0 / 3 * x + 11.0 / 3) && (y >= 5.0 / 3 * x + 5.0 / 3) ||
                        (y <= x + 1 && y >= 1.0 / 3 * x + 2.0 / 3))) ||
                ((x >= 2) && (x <= 3) && (y <= x + 1 && y >= 1.0 / 3 * x + 2.0 / 3)) ||
                ((x >= 3) && (x <= 4) && (y <= x + 1 && y >= 1.0 / 3 * x + 2.0 / 3)) ||
                ((x >= 4) && (x <= 5) && (y <= -1.0 / 2 * x + 7 && y >= x - 2)) ||
                ((x >= 5) && (x <= 6) && (y <= -1.0 / 2 * x + 7 && y >= x - 2))) {
            return "Точка попала на границу первой фигуры";
        }
        else if (((x >= 0) && (x <= 1) && (y <= 0.5 * x - 5) && (y >= 0.25 * x - 5)) ||
                ((x >= 1) && (x <= 2) && (y <= 0.5 * x - 5) && (y >= 0.25 * x - 5)) ||
                ((x >= 2) && (x <= 3) && ((y <= -x + 1) && (Math.pow(x - 4, 2) + Math.pow(y + 1, 2) <= 4) || (y <= 0.5 * x - 5) && (y >= 0.25 * x - 5))) ||
                ((x >= 3) && (x <= 4) && ((y <= x - 5) && (Math.pow(x - 4, 2) + Math.pow(y + 1, 2) <= 4) || (y <= 0.5 * x - 5) && (y >= 0.25 * x - 5))) ||
                ((x >= 4) && (x <= 5) && ((Math.pow(x - 4, 2) + Math.pow(y + 1, 2) <= 4) && (y >= -x + 5) || (y <= 0 && y >= -2) || (y <= -3 * x + 10) && (y >= -x))) ||
                ((x >= 5) && (x <= 6) && (Math.pow(x - 4, 2) + Math.pow(y + 1, 2) <= 4) && (y >= -2)) ||
                ((x >= 6) && (x <= 7) && (y <= -x + 5) && (y >= -2))) {
            return "Точка попала на границу второй фигуры";
        }
        else {
            return "Точка никуда не попала";
        }
    }
    public static void main(String[] args) throws IOException {
        File file1 = new File("C:\\Users\\Мишка\\Desktop\\z8.txt");
        FileWriter fwr = new FileWriter(file1, true);
        fwr.write("Постановка задачи\n\nПервая фигура\nx [-9;4]\n" +
                "\nВторая фигура\nx[-;-]\n" +
                "Точки для проверки\n\n№1 (0;2); №2 (6;6); №3 (-3;-2); №4 (6;4); №5 (3;-2)\n\nВЫВОД ДАННЫХ\n\n");
        fwr.write("Для точки №1\n");
        fwr.write(hit(0, 2)+"\n\n");
        fwr.write("Для точки №2\n");
        fwr.write(hit(6, 6)+"\n\n");
        fwr.write("Для точки №3\n");
        fwr.write(hit(-3, -2)+"\n\n");
        fwr.write("Для точки №4\n");
        fwr.write(hit(6, 4)+"\n\n");
        fwr.write("Для точки №5\n");
        fwr.write(hit(3, -2));
        fwr.flush();
        fwr.close();
    }
}
